Programación en SQL
===

Archivos de datos
---

In [ ]:
%%writefile data.csv
E,1,273.08,600,2016-12-31,0.21,BDGD
D,2,756.37,500,2019-02-28,0.37,BCCC
E,3,305.43,100,2017-05-21,0.21,BAED
D,4,662.69,800,2017-03-26,0.23,BGDD
C,5,822.81,100,2017-11-17,0.35,GGFC
A,6,391.42,300,2018-05-15,0.22,BFGB
C,7,755.27,800,2018-07-04,0.47,GCDB
E,8,302.86,700,2016-12-22,0.14,DFCC
C,9,267.42,200,2018-04-18,0.10,DGCE
A,10,816.51,600,2019-04-25,0.40,DAGC
C,11,346.64,900,2017-04-18,0.15,FBBC
B,12,999.72,800,2016-11-09,0.26,FCGD
C,13,712.61,400,2017-10-23,0.31,EDDA
E,14,832.44,800,2016-11-22,0.39,EGFD
C,15,370.58,900,2016-10-01,0.11,GCDD
B,16,283.40,600,2019-04-11,0.14,BDEE
E,17,692.93,200,2018-03-25,0.25,BGGA
A,18,142.99,100,2017-02-12,0.48,GGFD
C,19,570.43,400,2019-04-12,0.48,FBEE
A,20,938.16,300,2016-09-12,0.19,BECB
B,21,409.34,400,2019-04-29,0.23,GFAE
E,22,118.77,900,2016-10-29,0.32,GEFE
E,23,325.15,200,2019-04-21,0.19,FBGC
C,24,482.32,300,2019-05-03,0.11,CCCE
E,25,600.90,700,2018-11-07,0.36,BBBA
A,26,456.47,400,2018-01-28,0.11,FGED
E,27,720.90,800,2017-01-16,0.12,FBGD
B,28,326.45,700,2017-07-27,0.36,AGAA
D,29,317.77,200,2017-02-27,0.47,GCEA
A,30,135.80,900,2017-01-26,0.23,EGAB

Writing data.csv

In [ ]:
%%writefile tbl0.csv
A,5000,900,NMNJL,0.4
B,7000,100,OLPKN,0.2
C,1000,600,LMMML,0.2
D,4000,600,PJLJL,0.4
E,4000,200,PONNJ,0.4
F,2000,300,NNPJO,0.3
G,5000,100,NLPLO,0.2
H,1000,200,NLPPO,0.4
I,3000,300,PPPPL,0.3

Writing tbl0.csv

In [ ]:
%%writefile tbl1.csv
E,1,273.08,600,2016-12-31,0.21,BDGD
D,2,756.37,500,2019-02-28,0.37,BCCC
E,3,305.43,100,2017-05-21,0.21,BAED
D,4,662.69,800,2017-03-26,0.23,BGDD
C,5,822.81,100,2017-11-17,0.35,GGFC
A,6,391.42,300,2018-05-15,0.22,BFGB
C,7,755.27,800,2018-07-04,0.47,GCDB
E,8,302.86,700,2016-12-22,0.14,DFCC
C,9,267.42,200,2018-04-18,0.10,DGCE
A,10,816.51,600,2019-04-25,0.40,DAGC
C,11,346.64,900,2017-04-18,0.15,FBBC
B,12,999.72,800,2016-11-09,0.26,FCGD
C,13,712.61,400,2017-10-23,0.31,EDDA
E,14,832.44,800,2016-11-22,0.39,EGFD
C,15,370.58,900,2016-10-01,0.11,GCDD
B,16,283.40,600,2019-04-11,0.14,BDEE
E,17,692.93,200,2018-03-25,0.25,BGGA
A,18,142.99,100,2017-02-12,0.48,GGFD
C,19,570.43,400,2019-04-12,0.48,FBEE
A,20,938.16,300,2016-09-12,0.19,BECB
B,21,409.34,400,2019-04-29,0.23,GFAE
E,22,118.77,900,2016-10-29,0.32,GEFE
E,23,325.15,200,2019-04-21,0.19,FBGC
C,24,482.32,300,2019-05-03,0.11,CCCE
E,25,600.90,700,2018-11-07,0.36,BBBA
A,26,456.47,400,2018-01-28,0.11,FGED
E,27,720.90,800,2017-01-16,0.12,FBGD
B,28,326.45,700,2017-07-27,0.36,AGAA
D,29,317.77,200,2017-02-27,0.47,GCEA
A,30,135.80,900,2017-01-26,0.23,EGAB

Writing tbl1.csv

In [ ]:
%%writefile tbl2.csv
5,982.63,900,2018-04-13,0.25,VV-BV
19,718.58,700,2018-04-12,0.12,VZ-MX
15,850.49,700,2017-02-17,0.31,ZX-MV
29,539.04,500,2019-01-23,0.30,MZ-CV
6,354.74,600,2018-01-25,0.46,NX-CX
29,218.17,900,2017-05-27,0.23,ZC-ZX
20,362.54,300,2016-09-23,0.11,MN-XZ
17,102.83,500,2017-03-01,0.23,XC-VZ
1,478.54,100,2017-09-07,0.21,MC-CC
19,526.10,600,2017-07-18,0.22,VM-VX
17,291.64,400,2017-08-27,0.34,CM-NX
7,622.19,900,2017-03-21,0.26,CB-BB
9,790.70,700,2018-11-30,0.11,MZ-CV
16,789.66,400,2018-02-07,0.13,BM-CV
2,916.00,800,2018-07-19,0.10,VM-MX
17,208.04,700,2018-05-15,0.25,MZ-VX
8,146.04,500,2018-10-12,0.21,XM-ZB
18,352.27,500,2017-01-28,0.37,VM-XX
15,340.78,200,2019-02-06,0.34,MM-VB
1,799.86,200,2016-10-23,0.17,MB-NZ
4,445.87,500,2018-10-31,0.20,NZ-BX
22,205.93,500,2016-12-08,0.10,VX-CX
16,800.93,300,2017-03-16,0.15,XX-MC
12,153.38,300,2017-03-17,0.19,BM-VX
17,244.45,300,2018-02-01,0.16,CC-MZ
10,823.34,200,2016-11-09,0.29,MM-MC
17,958.74,400,2018-07-24,0.34,CN-NB
28,658.78,700,2017-09-01,0.48,MM-BX
4,696.30,100,2019-04-09,0.29,MM-BB
26,518.08,800,2019-03-28,0.20,XZ-CB
5,964.58,300,2018-10-20,0.28,XM-MC
18,544.61,400,2016-08-20,0.35,BV-CX
24,175.78,600,2018-02-14,0.27,MN-MC
1,685.89,200,2019-03-06,0.18,BM-BZ
11,187.88,800,2017-10-05,0.23,MX-XX
5,380.95,600,2018-07-13,0.30,VV-VB
21,519.30,600,2018-09-20,0.23,ZZ-VX
21,253.23,600,2017-07-04,0.21,VC-NX
23,558.78,600,2017-10-10,0.22,NM-MV
5,406.02,500,2018-04-14,0.43,MV-NX
7,446.69,600,2017-04-16,0.18,XZ-CC
5,730.59,400,2018-06-05,0.23,MV-MX
14,542.26,500,2016-11-05,0.47,MM-BX
8,671.67,900,2019-04-15,0.22,XM-NX
21,679.57,800,2018-01-13,0.42,CC-XX
6,281.34,700,2018-01-22,0.39,CN-BC
11,845.37,100,2018-04-05,0.31,CC-CB
16,614.98,900,2017-11-08,0.13,MC-ZV
21,713.19,800,2018-08-10,0.27,ZM-VV
10,175.45,500,2018-03-29,0.26,CN-NZ
26,147.56,800,2017-02-23,0.48,NV-BV
14,989.84,900,2018-11-07,0.46,MX-MC
2,853.23,500,2017-08-16,0.40,XM-CC
20,734.40,400,2017-06-12,0.24,XC-ZC
4,475.43,100,2017-08-18,0.44,CN-VX
20,623.67,500,2017-12-23,0.41,BZ-BV
29,265.52,700,2018-01-20,0.32,CC-MX
7,224.90,400,2017-06-25,0.18,MN-CB
18,586.28,800,2019-01-07,0.18,CB-XX
22,364.87,300,2017-10-20,0.45,CC-MX
7,822.01,700,2016-09-29,0.36,MB-BC
26,830.71,300,2018-10-20,0.22,NN-NX
5,260.74,400,2018-12-17,0.28,VN-ZC
23,814.55,600,2018-02-15,0.16,MM-MZ
25,563.26,900,2017-06-07,0.44,NC-XC
10,960.97,500,2018-06-27,0.38,BM-ZC
30,414.22,500,2018-09-24,0.28,XM-VV
8,599.22,300,2017-08-19,0.29,MC-NX
19,121.04,100,2018-08-07,0.48,MV-NZ
25,982.24,300,2018-10-07,0.15,ZX-MC
22,777.62,100,2018-06-22,0.42,CN-NB
8,815.40,700,2018-09-26,0.47,ZM-CC
16,812.77,900,2017-07-05,0.34,MM-ZV
23,552.52,900,2018-06-09,0.34,MZ-MC
8,179.19,900,2017-02-19,0.23,MN-XV
27,557.86,900,2018-06-08,0.31,NV-NB
20,918.93,200,2016-12-14,0.37,VV-BC
22,513.40,900,2019-05-04,0.22,ZB-ZZ
6,572.79,800,2017-01-23,0.19,ZN-ZC
27,251.40,300,2019-04-28,0.14,NM-NC
6,114.34,700,2018-10-13,0.41,XM-VB
29,101.11,100,2017-11-17,0.42,MV-CB
28,710.27,500,2017-01-05,0.32,XZ-MZ
18,220.74,700,2016-09-08,0.20,NM-CZ
20,985.46,400,2017-10-05,0.22,CV-BB
27,467.18,500,2017-12-13,0.30,CX-MZ
11,110.72,100,2018-05-03,0.45,BV-MV
26,894.28,200,2019-03-23,0.49,MC-CB
3,411.72,800,2017-06-04,0.17,MX-MV
6,124.64,400,2016-09-20,0.14,MB-XB
18,830.65,600,2017-01-29,0.37,CX-CX
28,496.90,600,2019-03-29,0.28,CM-ZZ
28,760.20,300,2018-09-25,0.11,XC-BC
11,856.50,600,2017-04-06,0.14,NC-MX
19,235.53,600,2018-08-07,0.45,ZX-BX
8,761.31,800,2017-07-18,0.36,MC-XB
17,395.67,400,2018-06-29,0.43,MX-VV
4,541.40,900,2017-01-10,0.34,MZ-MB
25,419.59,400,2018-07-20,0.15,VN-BZ
4,658.00,300,2018-11-15,0.16,XZ-BZ
4,658.67,900,2018-01-02,0.15,MZ-NZ
18,371.46,800,2017-12-27,0.34,MC-MV
28,356.30,400,2016-12-07,0.12,MN-BB
6,382.60,300,2019-03-21,0.20,BM-XB
16,915.72,900,2018-07-04,0.25,NZ-MV
12,197.55,200,2017-04-22,0.27,MX-MC
24,865.20,400,2017-03-22,0.44,NZ-VZ
22,157.88,200,2017-11-07,0.12,CM-ZZ
23,259.23,100,2019-01-05,0.45,VM-CX
24,239.61,600,2017-01-12,0.34,BZ-ZX
1,407.80,800,2018-07-10,0.15,ZZ-MC
9,531.02,500,2016-10-25,0.27,CV-ZZ
13,777.73,200,2016-09-10,0.26,ZZ-BV
8,490.07,400,2018-06-15,0.11,MV-CX
23,878.13,800,2019-01-24,0.25,XZ-MV
13,872.76,200,2016-09-16,0.36,BB-CB
27,998.03,600,2017-07-27,0.35,VM-XZ
22,612.05,600,2018-11-30,0.22,VV-MB
24,903.38,900,2017-11-10,0.45,MV-XX
28,213.67,600,2018-10-06,0.38,XM-MC

Writing tbl2.csv

Magic Cells
----

In [ ]:
import sqlite3
from IPython.core.magic import register_cell_magic, register_line_magic


conn = sqlite3.connect(":memory:")
cur = conn.cursor()

@register_cell_magic
def sqlite3(line, cell):
    cell = [
        l for l in cell.split("\n") if l[0:2] != "--" and l[0:2] not in ["--", "##"]
    ]
    cell = "\n".join(cell)
    return cur.execute(cell).fetchall()


@register_cell_magic
def sqlite3script(line, cell):
    cell = [l for l in cell.split("\n") if len(l) >= 2 and l[0:2] not in ["--", "##"]]
    cell = "\n".join(cell)
    conn.executescript(cell)
    conn.commit()


@register_line_magic
def sql(line):
    line = [
        l for l in line.split("\n") if l[0:2] != "--" and l[0:2] not in ["--", "##"]
    ]
    line = "\n".join(line)
    return cur.execute(line).fetchall()

Estructura de las tablas
---

La estructura de las tablas es la siguiente:
 
```
data
------------------------
  K0  CHAR(1)
  K1  INT
  c12 FLOAT
  c13 INT
  c14 DATE
  c15 FLOAT
  c16 CHAR(4)
  
tbl0
------------------------
  K0  CHAR(1)
  c01 INT
  c02 INT
  c03 CHAR(4)
  c04 FLOAT

tbl1
------------------------
  K0  CHAR(1)
  K1  INT
  c12 FLOAT
  c13 INT
  c14 DATE
  c15 FLOAT
  c16 CHAR(4)

tbl2
------------------------
  K1  INT,
  c21 FLOAT,
  c22 INT,
  c23 DATE,
  c24 FLOAT,
  c25 CHAR(5)  
```

Preparacion

In [ ]:
import pandas as pd

In [ ]:
# Apertura de Conexion
import sqlite3

conn = sqlite3.connect(":memory:") 
cur = conn.cursor()

In [ ]:
%%sqlite3script

DROP TABLE IF EXISTS data;

CREATE TABLE data (
    K0  CHAR(1),
    K1  INT,
    c12 FLOAT,
    c13 INT,
    c14 DATE,
    c15 FLOAT,
    c16 CHAR(4)
);

DROP TABLE IF EXISTS tbl0;

CREATE TABLE tbl0 (
    K0  CHAR(1),
    c01 INT,
    c02 INT,
    c03 CHAR(4),
    c04 FLOAT
);

DROP TABLE IF EXISTS tbl1;

CREATE TABLE tbl1 (
    K0  CHAR(1),
    K1  INT,
    c12 FLOAT,
    c13 INT,
    c14 DATE,
    c15 FLOAT,
    c16 CHAR(4)
);

DROP TABLE IF EXISTS tbl2;

CREATE TABLE tbl2 (
    K1  INT,
    c21 FLOAT,
    c22 INT,
    c23 DATE,
    c24 FLOAT,
    c25 CHAR(5)
);

In [ ]:
# Validacion de la creacion de las tablas
cur.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()

[('data',), ('tbl0',), ('tbl1',), ('tbl2',)]

In [ ]:
# Lectura de tabla data
with open("data.csv", "rt") as f:
    data = f.readlines()

# Elimina el '\n' al final de la línea
data = [line.replace('\n', '')  for line in data]

# Separa los campos por comas
data = [line.split(",") for line in data]

# Convierte la fila en una tupla
data = [tuple(line) for line in data]

#Cargando los datos desde la tabla
cur.executemany("INSERT INTO data VALUES (?,?,?,?,?,?,?)", data)

#
# Verificación
#
cur.execute("SELECT * FROM data LIMIT 1;").fetchall()

[('E', 1, 273.08, 600, '2016-12-31', 0.21, 'BDGD')]

In [ ]:
# Lectura de tabla data
with open("tbl0.csv", "rt") as f:
    data = f.readlines()

# Elimina el '\n' al final de la línea
data = [line.replace('\n', '')  for line in data]

# Separa los campos por comas
data = [line.split(",") for line in data]

# Convierte la fila en una tupla
data = [tuple(line) for line in data]

#Cargando los datos desde la tabla
cur.executemany("INSERT INTO tbl0 VALUES (?,?,?,?,?)", data)

#
# Verificación
#
cur.execute("SELECT * FROM tbl0 LIMIT 1;").fetchall()

[('A', 5000, 900, 'NMNJL', 0.4)]

In [ ]:
# Lectura de tabla tabl1
with open("tbl1.csv", "rt") as f:
    data = f.readlines()

# Elimina el '\n' al final de la línea
data = [line.replace('\n', '')  for line in data]

# Separa los campos por comas
data = [line.split(",") for line in data]

# Convierte la fila en una tupla
data = [tuple(line) for line in data]

#Cargando los datos desde la tabla
cur.executemany("INSERT INTO tbl1 VALUES (?,?,?,?,?,?,?)", data)

#
# Verificación
#
cur.execute("SELECT * FROM tbl1 LIMIT 1;").fetchall()

[('E', 1, 273.08, 600, '2016-12-31', 0.21, 'BDGD')]

In [ ]:
# Lectura de tabla tbl12
with open("tbl2.csv", "rt") as f:
    data = f.readlines()

# Elimina el '\n' al final de la línea
data = [line.replace('\n', '')  for line in data]

# Separa los campos por comas
data = [line.split(",") for line in data]

# Convierte la fila en una tupla
data = [tuple(line) for line in data]

cur.executemany("INSERT INTO tbl2 VALUES (?,?,?,?,?,?)", data)

#
# Verificación
#
cur.execute("SELECT * FROM tbl2 LIMIT 1;").fetchall()

[(5, 982.63, 900, '2018-04-13', 0.25, 'VV-BV')]

Ejercicio 1
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta en SQL que devuelva la suma del campo c12.
#
# Rta/
#    SUM(c12)
# 0  15137.63
#
tmp = %sql Select sum(c12) from tbl1
rta01 = pd.DataFrame (tmp, columns = ['SUM(c12)'])
print(rta01)

   SUM(c12)
0  15137.63

Ejercicio 2
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne la cantidad de registros
# de la tabla `data`.
#
# Rta/
#    COUNT(*)
# 0        30
tmp = %sql Select count (*) from data
rta02 = pd.DataFrame (tmp, columns = ['COUNT(*)'])
print(rta02)

   COUNT(*)
0        30

Ejercicio 3
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne los primeros cinco
# registros de la tabla `data` ordenados por fecha.
#
# Rta/
#   K0  K1     c12  c13         c14   c15   c16
# 0  A  20  938.16  300  2016-09-12  0.19  BECB
# 1  C  15  370.58  900  2016-10-01  0.11  GCDD
# 2  E  22  118.77  900  2016-10-29  0.32  GEFE
# 3  B  12  999.72  800  2016-11-09  0.26  FCGD
# 4  E  14  832.44  800  2016-11-22  0.39  EGFD
#
tmp = %sql Select * from data order by c14 LIMIT 5;
rt03=pd.DataFrame (tmp, columns = ['K0','K1','c12','c13','c14','c15','c16'])
print(rt03)

  K0  K1     c12  c13         c14   c15   c16
0  A  20  938.16  300  2016-09-12  0.19  BECB
1  C  15  370.58  900  2016-10-01  0.11  GCDD
2  E  22  118.77  900  2016-10-29  0.32  GEFE
3  B  12  999.72  800  2016-11-09  0.26  FCGD
4  E  14  832.44  800  2016-11-22  0.39  EGFD

Ejercicio 4
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne los campos K0 y c16
# para los registros de la tabla tbl1 para los que la 
# columna c16 empieza por la misma letra de la columna K0.
#
# Rta/
#   K0   c16
# 0  E  EGFD
# 1  B  BDEE
# 2  C  CCCE
#
tmp = %sql Select  K0, c16 FROM tbl1 WHERE SUBSTR(C16,1,1)=K0
rt04=pd.DataFrame (tmp, columns = ['K0','c16'])
print(rt04)

  K0   c16
0  E  EGFD
1  B  BDEE
2  C  CCCE

Ejercicio 5
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne todos los campos de 
# la tabla tbl0 para los que el campo c02 es igual a 100
# o igual a 600
#
# Rta/
#   K0   c01  c02    c03  c04
# 0  B  7000  100  OLPKN  0.2
# 1  C  1000  600  LMMML  0.2
# 2  D  4000  600  PJLJL  0.4
# 3  G  5000  100  NLPLO  0.2
#
tmp = %sql Select * FROM tbl0 WHERE c02=100 or c02=600
rt05=pd.DataFrame (tmp, columns = ['K0','c01','c02','c03','c04'])
print(rt05)

  K0   c01  c02    c03  c04
0  B  7000  100  OLPKN  0.2
1  C  1000  600  LMMML  0.2
2  D  4000  600  PJLJL  0.4
3  G  5000  100  NLPLO  0.2

Ejercicio 6
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne todos los campos de 
# la tabla tbl1 ordenada por fecha (c14) para los 
# registros con K0 igual a A
#
# Rta/
#   K0  K1     c12  c13         c14   c15   c16
# 0  A  20  938.16  300  2016-09-12  0.19  BECB
# 1  A  30  135.80  900  2017-01-26  0.23  EGAB
# 2  A  18  142.99  100  2017-02-12  0.48  GGFD
# 3  A  26  456.47  400  2018-01-28  0.11  FGED
# 4  A   6  391.42  300  2018-05-15  0.22  BFGB
# 5  A  10  816.51  600  2019-04-25  0.40  DAGC
#
tmp = %sql Select * FROM tbl1 WHERE K0='A'ORDER BY c14
rt06=pd.DataFrame (tmp, columns = ['K0','K1','c12','c13','c14','c15','c16'])
print(rt06)

  K0  K1     c12  c13         c14   c15   c16
0  A  20  938.16  300  2016-09-12  0.19  BECB
1  A  30  135.80  900  2017-01-26  0.23  EGAB
2  A  18  142.99  100  2017-02-12  0.48  GGFD
3  A  26  456.47  400  2018-01-28  0.11  FGED
4  A   6  391.42  300  2018-05-15  0.22  BFGB
5  A  10  816.51  600  2019-04-25  0.40  DAGC

Ejercicio 7
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne todos los campos de 
# la tabla tbl1 ordenada por fecha (c14) para los 
# registros con K0 diferente a A y B y c13 diferente 
# de 200 y 900
#
# Rta/
#    K0  K1     c12  c13         c14   c15   c16
# 0   E  14  832.44  800  2016-11-22  0.39  EGFD
# 1   E   8  302.86  700  2016-12-22  0.14  DFCC
# 2   E   1  273.08  600  2016-12-31  0.21  BDGD
# 3   E  27  720.90  800  2017-01-16  0.12  FBGD
# 4   D   4  662.69  800  2017-03-26  0.23  BGDD
# 5   E   3  305.43  100  2017-05-21  0.21  BAED
# 6   C  13  712.61  400  2017-10-23  0.31  EDDA
# 7   C   5  822.81  100  2017-11-17  0.35  GGFC
# 8   C   7  755.27  800  2018-07-04  0.47  GCDB
# 9   E  25  600.90  700  2018-11-07  0.36  BBBA
# 10  D   2  756.37  500  2019-02-28  0.37  BCCC
# 11  C  19  570.43  400  2019-04-12  0.48  FBEE
# 12  C  24  482.32  300  2019-05-03  0.11  CCCE

tmp = %sql Select * from tbl1 where K0 not in ('A','B') and c13 not in('200','900') order by c14
rta07 = pd.DataFrame (tmp, columns = ['K0','K1','c12','c13','c14','c15','c16']) 
print(rta07)

   K0  K1     c12  c13         c14   c15   c16
0   E  14  832.44  800  2016-11-22  0.39  EGFD
1   E   8  302.86  700  2016-12-22  0.14  DFCC
2   E   1  273.08  600  2016-12-31  0.21  BDGD
3   E  27  720.90  800  2017-01-16  0.12  FBGD
4   D   4  662.69  800  2017-03-26  0.23  BGDD
5   E   3  305.43  100  2017-05-21  0.21  BAED
6   C  13  712.61  400  2017-10-23  0.31  EDDA
7   C   5  822.81  100  2017-11-17  0.35  GGFC
8   C   7  755.27  800  2018-07-04  0.47  GCDB
9   E  25  600.90  700  2018-11-07  0.36  BBBA
10  D   2  756.37  500  2019-02-28  0.37  BCCC
11  C  19  570.43  400  2019-04-12  0.48  FBEE
12  C  24  482.32  300  2019-05-03  0.11  CCCE

Ejercicio 8
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que compute el promedio
# de la columna c21 de la tabla tbl2 por ano 
# (columna c23).
#
# Rta/
#    YEAR    avg(c21)
# 0  2016  564.476429
# 1  2017  515.156364
# 2  2018  557.559375
# 3  2019  550.998571
#
tmp = %sql Select strftime('%Y',c23), AVG(c21) from tbl2 GROUP BY strftime('%Y',c23)
rta08 = pd.DataFrame (tmp, columns = ['YEAR','avg(c21)']) 
print(rta08)

   YEAR    avg(c21)
0  2016  564.476429
1  2017  515.156364
2  2018  557.559375
3  2019  550.998571

Ejercicio 9
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne el registro
# con el menor valor en la columna c21 de la 
# tabla tbl2.
#
# Rta/
#    K1     c21  c22         c23   c24    c25
# 0  29  101.11  100  2017-11-17  0.42  MV-CB
#
tmp = %sql Select * from tbl2 ORDER BY c21 LIMIT 1;
rta09 = pd.DataFrame (tmp, columns = ['K1','c21','c22','c23','c24','c25']) 
print(rta09)

   K1     c21  c22         c23   c24    c25
0  29  101.11  100  2017-11-17  0.42  MV-CB

Ejercicio 10
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne todos los 
# campos de los registros de la tabla tbl0 
# con la columna c02 mayor o igual a 300.
#
# Rta/
#    K0   c01  c02    c03  c04
# 0   A  5000  900  NMNJL  0.4
# 1   C  1000  600  LMMML  0.2
# 2   D  4000  600  PJLJL  0.4
# 3   F  2000  300  NNPJO  0.3
# 4   I  3000  300  PPPPL  0.3
#
tmp = %sql Select * from tbl0 WHERE c02>=300
rta10 = pd.DataFrame (tmp, columns = ['K0','c01','c02','c03','c04']) 
print(rta10)

  K0   c01  c02    c03  c04
0  A  5000  900  NMNJL  0.4
1  C  1000  600  LMMML  0.2
2  D  4000  600  PJLJL  0.4
3  F  2000  300  NNPJO  0.3
4  I  3000  300  PPPPL  0.3

Ejercicio 11
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne el total 
# de registros de la tabla tbl1 para el ano
# 2018
#
# Rta/
#    YEAR  CANT
# 0  2018     6
#
tmp = %sql Select strftime('%Y',c14),COUNT(c14) from tbl1 WHERE strftime('%Y',c14)='2018' GROUP BY strftime('%Y',c14) 
rta11 = pd.DataFrame (tmp, columns = ['YEAR','CANT']) 
print(rta11)

   YEAR  CANT
0  2018     6

Ejercicio 12
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne por cada letra
# de la columna K0, el valor máximo de la coumna c12
# en la tabla tbl1.
#
# Rta/
#   K0  MAX(c12)  min(C12)
# 0  A    938.16    135.80
# 1  B    999.72    283.40
# 2  C    822.81    267.42
# 3  D    756.37    317.77
# 4  E    832.44    118.77
tmp = %sql Select K0,MAX(c12),MIN(c12) from tbl1 GROUP BY K0
rta12 = pd.DataFrame (tmp, columns = ['K0','MAX(c12)','min(C12)']) 
print(rta12)

  K0  MAX(c12)  min(C12)
0  A    938.16    135.80
1  B    999.72    283.40
2  C    822.81    267.42
3  D    756.37    317.77
4  E    832.44    118.77

Ejercicio 13
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne por cada letra
# de la columna K0, el valor promedio de la columna c12
# en la tabla tbl1, para aquellos registros con c13 mayor
# a 400.
#
# Rta/
#   K0    avg(c12)
# 0  A  476.155000
# 1  B  536.523333
# 2  C  490.830000
# 3  D  709.530000
# 4  E  474.825000
#
tmp = %sql Select K0, AVG(c12) from tbl1 WHERE c13 > 400 GROUP BY K0
rta13 = pd.DataFrame (tmp, columns = ['K0','avg(c12)']) 
print(rta13)

  K0    avg(c12)
0  A  476.155000
1  B  536.523333
2  C  490.830000
3  D  709.530000
4  E  474.825000

Ejercicio 14
---

In [ ]:
#%%sqlite3
#
# Escriba una consulta que retorne por cada letra
# de la columna K0, el valor promedio de la columna c21
# en la tabla tbl2, para aquellos registros con c13 mayor
# a 400.
#
# Rta/
# K0    avg(c21)
# 0  A  593.495000
# 1  B  575.470000
# 2  C  530.753000
# 3  D  655.612500
# 4  E  555.323077

tmp = %sql Select K0, avg(c21) from tbl1 INNER JOIN tbl2 ON tbl1.K1=tbl2.K1 WHERE c13 > 400 GROUP BY K0
rta14 = pd.DataFrame (tmp, columns = ['K0','avg(c21)']) 
print(rta14)

  K0    avg(c21)
0  A  593.495000
1  B  575.470000
2  C  530.753000
3  D  655.612500
4  E  555.323077